; domain
(define (domain boat)
  (:requirements :strips :typing :equality :negative-preconditions :adl) 
  (:types cargo
          shore)
  
  (:predicates (atShore ?obj - cargo ?sh - shore)
		       (eats ?obj1 - cargo ?obj2 - cargo)
		       (on ?sh - shore)
		       (onBoat ?obj))
  
(:action TAKE_TO_BOAT  
    :parameters    (?obj - cargo ?sh - shore)
    :precondition  (and (atShore ?obj ?sh) (on ?sh)
                    (not (exists (?cargo1 - cargo ?cargo2 - cargo) 
                    (and (eats ?cargo1 ?cargo2) (atShore ?cargo1 ?sh) (atShore ?cargo2 ?sh)
                    (not( = ?cargo1 ?obj)) (not(= ?cargo2 ?obj))))))
    :effect        (and (not (on ?sh)) (not (atShore ?obj ?sh)) (onBoat ?obj)))

(:action TAKE_TO_SHORE 
    :parameters    (?obj - cargo ?sh1 - shore)
    :precondition (and (not(on ?sh1)) (not(atShore ?obj ?sh1)) (onBoat ?obj)) 
    :effect        (and (on ?sh1) (atShore ?obj ?sh1) (not(onBoat ?obj))))

(:action GO_TO_SHORE
    :parameters    (?sh1 - shore ?sh2 - shore)
    :precondition (and (on ?sh1) (not(on ?sh2))
                    (not (exists (?cargo1 - cargo ?cargo2 - cargo) 
                    (and (eats ?cargo1 ?cargo2) (atShore ?cargo1 ?sh1) (atShore ?cargo2 ?sh1)))))
    :effect        (and (on ?sh2) (not (on ?sh1))))
)

; problem
(define (problem wolf_problem)
(:domain boat)
(:objects
 wolf - cargo
 goat - cargo
 cabbage - cargo
 shore1 - shore
 shore2 - shore)

(:init (atShore wolf shore1) (atShore goat shore1) (atShore cabbage shore1)
(eats wolf goat) (eats goat cabbage) (on shore1))

(:goal (and (atShore wolf shore2) (atShore goat shore2) (atShore cabbage shore2) (on shore2)))
)

; plan
1. (take_to_boat goat shore1)
   deleted: (on shore1) (atshore goat shore1)
   added: (onboat goat)
   goals met: 0 of 4
2. (take_to_shore goat shore2)
   deleted: (onboat goat)
   added: (on shore2) (atshore goat shore2)
   goals met: 2 of 4
3. (go_to_shore shore2 shore1)
   deleted: (on shore2)
   added: (on shore1)
   goals met: 1 of 4
4. (take_to_boat wolf shore1)
   deleted: (on shore1) (atshore wolf shore1)
   added: (onboat wolf)
   goals met: 1 of 4
5. (take_to_shore wolf shore2)
   deleted: (onboat wolf)
   added: (on shore2) (atshore wolf shore2)
   goals met: 3 of 4
6. (take_to_boat goat shore2)
   deleted: (on shore2) (atshore goat shore2)
   added: (onboat goat)
   goals met: 1 of 4
7. (take_to_shore goat shore1)
   deleted: (onboat goat)
   added: (on shore1) (atshore goat shore1)
   goals met: 1 of 4
8. (take_to_boat cabbage shore1)
   deleted: (on shore1) (atshore cabbage shore1)
   added: (onboat cabbage)
   goals met: 1 of 4
9. (take_to_shore cabbage shore2)
   deleted: (onboat cabbage)
   added: (on shore2) (atshore cabbage shore2)
   goals met: 3 of 4
10. (go_to_shore shore2 shore1)
   deleted: (on shore2)
   added: (on shore1)
   goals met: 2 of 4
11. (take_to_boat goat shore1)
   deleted: (on shore1) (atshore goat shore1)
   added: (onboat goat)
   goals met: 2 of 4
12. (take_to_shore goat shore2)
   deleted: (onboat goat)
   added: (on shore2) (atshore goat shore2)
   goals met: 4 of 4
